load/results/after/baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * mixed_steady: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 930 complete and 0 interrupted iterations
mixed_steady   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 1987 complete and 0 interrupted iterations
mixed_steady   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 3030 complete and 0 interrupted iterations
mixed_steady   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 3890 complete and 0 interrupted iterations
mixed_steady   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 4760 complete and 0 interrupted iterations
mixed_steady   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 5818 complete and 0 interrupted iterations
mixed_steady   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 6869 complete and 0 interrupted iterations
mixed_steady   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 7859 complete and 0 interrupted iterations
mixed_steady   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 8910 complete and 0 interrupted iterations
mixed_steady   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 9918 complete and 0 interrupted iterations
mixed_steady   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 10922 complete and 0 interrupted iterations
mixed_steady   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 11910 complete and 0 interrupted iterations
mixed_steady   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 12750 complete and 0 interrupted iterations
mixed_steady   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 13753 complete and 0 interrupted iterations
mixed_steady   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 14829 complete and 0 interrupted iterations
mixed_steady   [ 100% ] 10 VUs  15.0s/15s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 74200   4945.159712/s
    checks_succeeded...: 100.00% 74200 out of 74200
    checks_failed......: 0.00%   0 out of 74200

    ✓ 278 ok
    ✓ 835 ok
    ✓ hl7 ok
    ✓ fhir ok
    ✓ decide ok

    HTTP
    http_req_duration..............: avg=1.99ms min=330µs  med=1.84ms p(95)=2.78ms  p(99)=4.35ms max=21.82ms
      { expected_response:true }...: avg=1.99ms min=330µs  med=1.84ms p(95)=2.78ms  p(99)=4.35ms max=21.82ms
    http_req_failed................: 0.00% 0 out of 74200
    http_reqs......................: 74200 4945.159712/s

    EXECUTION
    iteration_duration.............: avg=10.1ms min=6.88ms med=9.61ms p(95)=12.86ms p(99)=20.7ms max=50.29ms
    iterations.....................: 14840 989.031942/s
    vus............................: 10    min=10         max=10
    vus_max........................: 10    min=10         max=10

    NETWORK
    data_received..................: 17 MB 1.2 MB/s
    data_sent......................: 34 MB 2.2 MB/s



running (15.0s), 00/10 VUs, 14840 complete and 0 interrupted iterations
mixed_steady ✓ [ 100% ] 10 VUs  15s