load/results/after/fhir_sweep_vus20.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 20 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 20/20 VUs, 4374 complete and 0 interrupted iterations
fhir_steady   [   7% ] 20 VUs  01.0s/15s

running (02.0s), 20/20 VUs, 8763 complete and 0 interrupted iterations
fhir_steady   [  13% ] 20 VUs  02.0s/15s

running (03.0s), 20/20 VUs, 13155 complete and 0 interrupted iterations
fhir_steady   [  20% ] 20 VUs  03.0s/15s

running (04.0s), 20/20 VUs, 17548 complete and 0 interrupted iterations
fhir_steady   [  27% ] 20 VUs  04.0s/15s

running (05.0s), 20/20 VUs, 21947 complete and 0 interrupted iterations
fhir_steady   [  33% ] 20 VUs  05.0s/15s

running (06.0s), 20/20 VUs, 26315 complete and 0 interrupted iterations
fhir_steady   [  40% ] 20 VUs  06.0s/15s

running (07.0s), 20/20 VUs, 30699 complete and 0 interrupted iterations
fhir_steady   [  47% ] 20 VUs  07.0s/15s

running (08.0s), 20/20 VUs, 35093 complete and 0 interrupted iterations
fhir_steady   [  53% ] 20 VUs  08.0s/15s

running (09.0s), 20/20 VUs, 39356 complete and 0 interrupted iterations
fhir_steady   [  60% ] 20 VUs  09.0s/15s

running (10.0s), 20/20 VUs, 43685 complete and 0 interrupted iterations
fhir_steady   [  67% ] 20 VUs  10.0s/15s

running (11.0s), 20/20 VUs, 48095 complete and 0 interrupted iterations
fhir_steady   [  73% ] 20 VUs  11.0s/15s

running (12.0s), 20/20 VUs, 52389 complete and 0 interrupted iterations
fhir_steady   [  80% ] 20 VUs  12.0s/15s

running (13.0s), 20/20 VUs, 55763 complete and 0 interrupted iterations
fhir_steady   [  87% ] 20 VUs  13.0s/15s

running (14.0s), 20/20 VUs, 59970 complete and 0 interrupted iterations
fhir_steady   [  93% ] 20 VUs  14.0s/15s

running (15.0s), 20/20 VUs, 64148 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 20 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 128360  8554.667699/s
    checks_succeeded...: 100.00% 128360 out of 128360
    checks_failed......: 0.00%   0 out of 128360

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=4.64ms min=2.14ms med=4.52ms p(95)=5.2ms  p(99)=6.27ms max=85.5ms 
      { expected_response:true }...: avg=4.64ms min=2.14ms med=4.52ms p(95)=5.2ms  p(99)=6.27ms max=85.5ms 
    http_req_failed................: 0.00%  0 out of 64180
    http_reqs......................: 64180  4277.333849/s

    EXECUTION
    iteration_duration.............: avg=4.67ms min=2.96ms med=4.55ms p(95)=5.23ms p(99)=6.3ms  max=85.62ms
    iterations.....................: 64180  4277.333849/s
    vus............................: 20     min=20         max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 19 MB  1.2 MB/s
    data_sent......................: 6.0 MB 402 kB/s



running (15.0s), 00/20 VUs, 64180 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 20 VUs  15s